---
kind: property
id: P:Autodesk.Revit.DB.CompoundStructureLayer.MaterialId
source: html/c5a502aa-217c-b76b-b1ad-33f57cc7b24d.htm
---
# Autodesk.Revit.DB.CompoundStructureLayer.MaterialId Property

Id of the material assigned to this layer.

## Syntax (C#)
```csharp
public ElementId MaterialId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null